wpax-dcqos2/deathstarbench-social-network/2023-04-03T17-03-55UTC/info/sysbench_logs.log
2023-04-03 17:03:49,438 [INFO] Resource 'XMLSchema.xsd' is already loaded
2023-04-03 17:03:50,319 [INFO] Starting experiment using following settings:
*kube config path: /kube/config,
*context name: wpax-dcqos2,
*experiment spec: None,
*experiment path: /spec/examples/dsb_social_network_example_short.json

2023-04-03 17:03:50,319 [INFO] Loading experiment definition...
2023-04-03 17:03:50,404 [INFO] Waiting for pods
2023-04-03 17:03:53,372 [INFO] All pods Running
2023-04-03 17:03:55,640 [INFO] Cloning remote repository git@github.com:a-barska/my_repo.git ...
2023-04-03 17:03:58,139 [INFO] Successfully cloned remote repository a-barska-my-repo to local path: /sysbench/a-barska-my-repo
2023-04-03 17:03:58,140 [INFO] Executing tests
2023-04-03 17:03:58,141 [INFO] Executing iteration 1 / 1
2023-04-03 17:03:58,142 [INFO] Executing: ['/bin/bash', '-c', 'wrk2/wrk -t150 -c1700 -d 5s -L -s "socialnet/wrk-scripts/read-home-timeline.lua" http://nginx-thrift:8080 -R 10000']
2023-04-03 17:04:05,183 [INFO] Running 5s test @ http://nginx-thrift:8080
  150 threads and 1700 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     6.03ms    3.33ms  22.74ms   91.52%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.12ms
 75.000%    6.38ms
 90.000%    8.74ms
 99.000%   22.74ms
 99.900%   32.83ms
 99.990%   36.67ms
 99.999%   41.50ms
100.000%   41.50ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.401     0.000000            1         1.00
       3.853     0.100000         4796         1.11
       4.183     0.200000         9609         1.25
       4.483     0.300000        14360         1.43
       4.787     0.400000        19145         1.67
       5.123     0.500000        23939         2.00
       5.311     0.550000        26345         2.22
       5.519     0.600000        28739         2.50
       5.759     0.650000        31131         2.86
       6.043     0.700000        33509         3.33
       6.375     0.750000        35896         4.00
       6.583     0.775000        37093         4.44
       6.831     0.800000        38293         5.00
       7.123     0.825000        39484         5.71
       7.507     0.850000        40677         6.67
       8.023     0.875000        41872         8.00
       8.351     0.887500        42473         8.89
       8.743     0.900000        43068        10.00
       9.239     0.912500        43670        11.43
       9.839     0.925000        44262        13.33
      10.535     0.937500        44868        16.00
      10.919     0.943750        45160        17.78
      11.447     0.950000        45459        20.00
      11.991     0.956250        45759        22.86
      12.719     0.962500        46058        26.67
      13.735     0.968750        46355        32.00
      14.447     0.971875        46506        35.56
      15.175     0.975000        46655        40.00
      16.151     0.978125        46804        45.71
      17.247     0.981250        46953        53.33
      18.735     0.984375        47105        64.00
      19.775     0.985938        47179        71.11
      20.527     0.987500        47253        80.00
      21.951     0.989062        47327        91.43
      23.391     0.990625        47402       106.67
      24.543     0.992188        47477       128.00
      25.119     0.992969        47514       142.22
      25.887     0.993750        47551       160.00
      26.607     0.994531        47589       182.86
      27.279     0.995313        47627       213.33
      28.159     0.996094        47664       256.00
      29.039     0.996484        47682       284.44
      29.679     0.996875        47701       320.00
      30.271     0.997266        47720       365.71
      30.799     0.997656        47739       426.67
      31.455     0.998047        47757       512.00
      31.583     0.998242        47766       568.89
      31.855     0.998437        47776       640.00
      32.271     0.998633        47785       731.43
      32.543     0.998828        47794       853.33
      33.023     0.999023        47804      1024.00
      33.183     0.999121        47809      1137.78
      33.439     0.999219        47813      1280.00
      33.695     0.999316        47818      1462.86
      33.823     0.999414        47822      1706.67
      34.047     0.999512        47827      2048.00
      34.175     0.999561        47829      2275.56
      34.591     0.999609        47832      2560.00
      34.911     0.999658        47834      2925.71
      35.199     0.999707        47836      3413.33
      35.455     0.999756        47839      4096.00
      35.519     0.999780        47840      4551.11
      35.807     0.999805        47841      5120.00
      35.871     0.999829        47842      5851.43
      36.191     0.999854        47843      6826.67
      36.671     0.999878        47845      8192.00
      36.671     0.999890        47845      9102.22
      37.119     0.999902        47846     10240.00
      37.119     0.999915        47846     11702.86
      37.663     0.999927        47847     13653.33
      38.591     0.999939        47848     16384.00
      38.591     0.999945        47848     18204.44
      38.591     0.999951        47848     20480.00
      38.591     0.999957        47848     23405.71
      40.671     0.999963        47849     27306.67
      40.671     0.999969        47849     32768.00
      40.671     0.999973        47849     36408.89
      40.671     0.999976        47849     40960.00
      40.671     0.999979        47849     46811.43
      41.503     0.999982        47850     54613.33
      41.503     1.000000        47850          inf
#[Mean    =        6.028, StdDeviation   =        3.334]
#[Max     =       41.472, Total count    =        47850]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  48002 requests in 5.01s, 548.38MB read
Requests/sec:   9589.63
Transfer/sec:    109.55MB

2023-04-03 17:04:05,185 [INFO] Prepared log file: /sysbench/logs/10000R-1700c-5d-150t/wrk2_10000R_1700c_5d_150t_1iteration.txt
2023-04-03 17:04:05,186 [INFO] Iteration 1 has finished
2023-04-03 17:04:05,188 [INFO] Parsing wrk2 result files
2023-04-03 17:04:05,191 [INFO] Parsing /sysbench/logs/10000R-1700c-5d-150t/wrk2_10000R_1700c_5d_150t_1iteration.txt
2023-04-03 17:04:05,225 [INFO] Executing post test
2023-04-03 17:04:05,228 [INFO] Pushing to the repository 'a-barska-my-repo'
2023-04-03 17:04:05,254 [INFO] Successfully opened local repository 'a-barska-my-repo' from local path: /sysbench/a-barska-my-repo